In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"이름": ["김철수", "이하윤", "박민수"],
                   "학번": [10103, 10211, 10321],
                   "수학점수": [83, 85, 87],
                   "영어점수": [75, 92, 97]})
df

    이름     학번  수학점수  영어점수
0  김철수  10103    83    75
1  이하윤  10211    85    92
2  박민수  10321    87    97

산술연산에 사용되는 Series의 각종 메서드는 DataFrame에 사용할 경우 축방향 연산을 지원한다. 즉, column방향 또는 row방향의 연산을 지원하며 이는 "axis" 인자로 방향 조정이 가능하다.

In [5]:
df.mean()

C:\Users\Encaion\AppData\Local\Temp\ipykernel_23944\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

학번      10211.666667
수학점수       85.000000
영어점수       88.000000
dtype: float64

In [6]:
df.mean(axis = 0)

C:\Users\Encaion\AppData\Local\Temp\ipykernel_23944\777590737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean(axis = 0)

학번      10211.666667
수학점수       85.000000
영어점수       88.000000
dtype: float64

In [7]:
df.mean(axis = 1)

C:\Users\Encaion\AppData\Local\Temp\ipykernel_23944\3216275966.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis = 1)

0    3420.333333
1    3462.666667
2    3501.666667
dtype: float64

In [10]:
print(df.iloc[0, 1:].mean())
print(df.iloc[1, 1:].mean())
print(df.iloc[2, 1:].mean())

3420.3333333333335
3462.6666666666665
3501.6666666666665

In [11]:
df.mean(numeric_only = True)

학번      10211.666667
수학점수       85.000000
영어점수       88.000000
dtype: float64

In [12]:
df[["수학점수", "영어점수"]].mean()

수학점수    85.0
영어점수    88.0
dtype: float64

In [13]:
df[["수학점수", "영어점수"]].mean(axis = 1)

0    79.0
1    88.5
2    92.0
dtype: float64

DataFrame의 메서드가 원하는 연산을 지원하지 않을 때는 .apply() 메서드와 함께 lambda 함수 또는 사용자 정의 함수를 사용해야 한다.

In [14]:
def mean_100(x):
    return x.mean() + 100

In [16]:
df.iloc[:, 2:].apply(mean_100)

수학점수    185.0
영어점수    188.0
dtype: float64

In [17]:
df.iloc[:, 2:].apply(mean_100, axis = 1)

0    179.0
1    188.5
2    192.0
dtype: float64

In [18]:
df.iloc[:, 2:].apply(lambda x: x.mean() + 100)

수학점수    185.0
영어점수    188.0
dtype: float64

In [19]:
df.iloc[:, 2:].apply(lambda x: x.mean() + 100, axis = 1)

0    179.0
1    188.5
2    192.0
dtype: float64